Core/src/Documents/НачислениеНалоговыхЛгот/НачислениеНалоговыхЛгот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеНалоговыхЛгот</name>
  <registerRecords>InformationRegister.НалоговыеЛготыИнформация</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Подразделения</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентПодоходного</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/Documents/НачислениеНалоговыхЛгот/ManagerModule.bsl
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаНачислениеНалоговыхЛгот, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НачислениеНалоговыхЛгот.Ссылка.Дата КАК Дата,
		|	НачислениеНалоговыхЛгот.Ссылка.Сотрудник КАК Сотрудник,
		|	НачислениеНалоговыхЛгот.Подразделение,
		|	НачислениеНалоговыхЛгот.Ссылка.Сумма КАК Сумма,
		|	НачислениеНалоговыхЛгот.ПроцентПодоходного,
		|	НачислениеНалоговыхЛгот.Ссылка.Организация КАК Организация  
		|ПОМЕСТИТЬ ВременнаяТаблицаШапка
		|ИЗ
		|	Документ.НачислениеНалоговыхЛгот.Подразделения КАК НачислениеНалоговыхЛгот
		|ГДЕ
		|	НачислениеНалоговыхЛгот.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаНачислениеНалоговыхЛгот);	
	Запрос.ВыполнитьПакет();
	
	СформироватьТаблицаНалоговыеЛготыИнформация(ДокументСсылкаНачислениеНалоговыхЛгот, СтруктураДополнительныеСвойства);
		
КонецПроцедуры

Процедура СформироватьТаблицаНалоговыеЛготыИнформация(ДокументСсылкаНачислениеНалоговыхЛгот, СтруктураДополнительныеСвойства)

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблицаШапка.Дата КАК Период,
	|	ВременнаяТаблицаШапка.Организация,
	|	ВременнаяТаблицаШапка.Сотрудник КАК Сотрудник,
	|	ВременнаяТаблицаШапка.Подразделение КАК Подразделение,
	|	ВременнаяТаблицаШапка.ПроцентПодоходного КАК ПроцентПодоходного,
	|	ВременнаяТаблицаШапка.Сумма КАК Сумма
	|ИЗ
	|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаНалоговыеЛготыИнформация", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры
